Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །ཚོགས་ནི་ཆེན་པོ་བསྡུས་པ་ཡང་།
en: “Since you have gathered this great assembly

source: །དུས་གཅིག་ཏུ་ནི་འདིར་མཛད་པས།
en: Instantly in this place,

source: །ལྷ་རྣམས་ཐམས་ཅད་བསྔགས་བགྱིད་ཅིང་།
en: All the gods are praising you,

source: །བཤེས་གཉེན་དཔལ་ཡང་ཉེ་བར་འཛིན།
en: And the glorious spiritual friends worship you.

source: །དེར་ནི་འཇིག་རྟེན་མགོན་པོ་ཡིས།
en: “O protector of the world,

source: །འདི་ནི་ལན་ཅིག་ཁོ་ན་བསྟན།
en: You only demonstrate this on one occasion.

source: །རྟག་ཏུ་ལྷ་མིན་ཤེས་རབ་ལྡན། །བཤེས་གཉེན་དཔལ་ཡང་ཉེ་བར་འཛིན།
en: The wise asuras and the glorious spiritual friends Are continuously worshiping you.

source: །དཔལ་གྱི་མེ་ཏོག་སྙིང་པོ་ནི། །དཔལ་རྣམས་ཀུན་གྱིས་ཀུན་ཏུ་བརྒྱན། །དེ་ཡིས་ཤཱཀྱའི་དཔལ་ཞུ་བར། །བདག་ཅག་ཕོ་ཉར་མངགས་པ་ལགས།
en: “Glorious Essence of Flowers Is adorned with all aspects of glory; He has sent us here as messengers To ask you these questions.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བརྒྱད་ཅུའི་བྱེ་མ་སྙེད་འདས་ནས་སྙིགས་མ་ལྔ་དང་ལྡན་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཡང་དག་པར་འཕགས་པ་ཞེས་བགྱི་བ་མཆིས་སོ། །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་ཞེས་བགྱི་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: “Respected Blessed One, in the northern direction, beyond buddha realms as numerous as the grains of sand in eighty Ganges Rivers, in a place ripe with the five degenerations, there is a world called Manifestation of All Perfumes, where the thus-gone, worthy, perfect Buddha Glorious Essence of Flowers resides and teaches the Dharma.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཁྱོད་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་འབྱང་བའི་གཟུངས་སྔགས་འདི་འཆད་པ་ལ་དད་པ་སྦྱིན་པར་མཛད་ཅིང་གནོད་པ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། སྟོབས་དང་ལྡན་ནམ།
en: He puts faith in the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra expounded by you that cleanses the karmic actions of sentient beings. He enquires whether you have any ills or problems and whether you are healthy and well.

source: བདེ་བ་ལ་རིག་པར་གནས་སམ་ཞེས་ཀྱང་ཞུ་བར་མཛད་ལགས་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་བསྙུང་བ་མི་མངའ་ལགས་སམ། གནོད་པ་ཆུང་ལགས་སམ།
en: Respected Blessed One, are you healthy and free from ills?

source: ཁྱོད་ཀྱི་འཁོར་བྲོ་འཚལ་བ་མ་མཆིས་སམ། གནོད་པ་ཆུང་ལགས་སམ།
en: Are the members of your retinue comfortable and in good health?

source: ཇི་ལྟར་ཆོས་རྗེས་སུ་ཐོས་པ་བཞིན་དུ་ཆོས་དེ་ལ་ནན་ཏན་སྙིང་པོར་བགྱིད་པ་དག་ལགས་སམ།
en: Do they follow the Dharma persistently in the way they hear it?

source: འདི་ན་ཐོགས་པ་མ་མཆིས་པར་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་ལགས་སམ།
en: Are you turning the Dharma wheel without obstruction in this place?

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ན་གང་སུ་དག་འཁོར་ལོ་སྐོར་བར་འགྱུར་བ་དེ་དག་གི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་ཁྱོད་དང་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་འབྱང་བའི་གཟུངས་སྔགས་འདི་ལ་དད་པ་སྦྱིན་པར་མཛད་ལགས་སོ།
en: For the sake of those who will turn the wheel in this buddha realm, the thus-gone Royal Mass of Glorious Wisdom puts faith in you and in the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that cleanses the karmic actions of sentient beings.

source: །དེ་ནས་ཞི་བ་རིག་པ་མཆིས་པའི་སྦུབས་ཞི་བའི་གཟུངས་སྔགས་མཐུ་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: Moreover, he also confers this powerful and beneficial dhāraṇī mantra peaceful core of knowledge.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བགྱིད་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། ཉོན་མོངས་པ་ཐམས་ཅད་འདུལ་བར་བགྱིད་པ།
en: It benefits all sentient beings, completely cures all diseases, and completely subdues all afflictions.

source: ཕུང་པོ་དང་སྐྱེ་མཆེད་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བགྱིད་པ། ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པར་བགྱིད་པ། ཐབས་ཐམས་ཅད་ཡང་དག་པར་སྟོན་པར་བགྱིད་པ། བྱང་གྲོལ་གྱི་བདེ་བ་ཐམས་ཅད་ཡོངས་སུ་མྱོང་བར་བགྱིད་པ།
en: It generates complete knowledge of all the aggregates and elements, causes one to discern all phenomena, reveals all the skillful means, and causes one to experience the entirety of the happiness of emancipation.

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དད་པར་བགྱིད་པ། ཆོས་ཐམས་ཅད་ཀྱི་བདེ་བ་ལ་འཇུག་པར་བགྱིད་པ། བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཆོས་དང་འཐུན་པས་ཚར་གཅོད་པར་བགྱིད་པ།
en: It induces sincere faith in all sentient beings, causes one to attain happiness related to all phenomena, eradicates all māras and enemies in accordance with the Dharma, and subjugates all the domains of the māras.

source: བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་རྣམ་པར་འཇིག་པར་བགྱིད་པ་འདི་ཡང་བསྐུར་ལགས་ཏེ། རིག་པ་མཆིས་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་འདི་ནི་བདུད་རྣམས་ཚར་གཅོད་པར་བགྱིད་པ། ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཕམ་པར་བགྱིད་པ།
en: This great teaching of the peaceful core of knowledge annihilates all māras and vanquishes enemies.

source: ལྷ་རྣམས་དགའ་བར་བགྱིད་པ། གནོད་སྦྱིན་རྣམས་ཡང་དག་པར་མགུ་བར་བགྱིད་པ། ལྷ་མ་ཡིན་རྣམས་རྣམ་པར་འཇོམས་པར་བགྱིད་པ། ནམ་མཁའ་ལྡིང་རྣམས་ཡང་དག་པར་མགུ་བར་བགྱིད་པ། མི་འམ་ཅི་རྣམས་དད་པར་བགྱིད་པ། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་རྒྱབ་ཀྱིས་ཕྱོགས་པར་བགྱིད་པ།
en: It pleases the gods, delights the yakṣas, overcomes the asuras, pleases the garuḍas, generates faith in the kinnaras, and puts the mahoragas to flight.

source: ཕས་ཀྱི་རྒོལ་བ་རྣམས་འདུལ་བར་བགྱིད་པ། རྒྱལ་རིགས་རྣམས་མངོན་པར་དགའ་བར་བགྱིད་པ། བྲམ་ཟེ་རྣམས་འཇུག་པར་བགྱིད་པ། རྗེའུ་རིགས་རྣམས་རབ་ཏུ་འཇོམས་པར་བགྱིད་པ། དམངས་རིགས་རྣམས་མཆོག་ཏུ་དགའ་བར་བགྱིད་པ།
en: It subdues all enemies, delights the members of the kṣatriya class, induces comprehension in the brāhmaṇas, overcomes the vaiśyas, and utterly pleases the śūdras.

source: བུད་མེད་འདོད་ཆགས་དང་བྲལ་བར་བགྱིད་པ། བུད་མེད་སྦྲུམ་པ་བདེ་ལེགས་སུ་ཡོངས་སུ་ཐར་བར་བགྱིད་པ། མང་དུ་ཐོས་པ་རྣམས་དྲན་པར་བགྱིད་པ། རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་མངོན་པར་དགའ་བར་བགྱིད་པ།
en: It frees women from their desires, easily releases pregnant women, induces recollection in the scholars, and delights the spiritual practitioners.

source: ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པ། འཐབ་པ་དང་། ཐབ་མོ་དང་། མུ་གེ་དང་། མི་ངས་དང་། ནད་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། ཆར་པ་དང་། ཆུ་བོ་དང་། གྲང་བ་དང་། དྲོ་བ་དང་། ཁ་བ་དང་། ཚ་བ་དང་། རྩུབ་པ་དང་། ཧྲུད་ཧྲུད་པོ་དང་། འདུས་ཏེ་རེག་པར་དཀའ་བ་རྣམས་རྣམ་པར་ཞི་བར་བགྱིད་པ།
en: It completely pacifies all sicknesses, quarrels, fights, famines, epidemics, diseases, hostile armies, untimely winds, rains, rivers, cold, heat, snow, and heat waves, and it softens substances that are harsh, rough, and hard to touch.

source: ཆོས་ཀྱི་ཚུལ་འབར་བར་བགྱིད་པ། སངས་རྒྱས་ཀྱི་བསྟན་པ་རྟོན་པར་བགྱིད་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་འཆད་པར་བགྱིད་པ།
en: It causes the way of the Dharma to blaze, it reveals the teachings of the buddhas, and it ensures that the lineage of the Three Jewels remains uninterrupted.

source: འཁོར་བས་སྐྲག་པ་རྣམས་དབུགས་འབྱིན་པར་བགྱིད་པ། ཟད་པ་ཤེས་པ་སྐྱེད་པར་བགྱིད་པ། མི་སྐྱེ་བ་ཤེས་པ་རང་གི་མངོན་སུམ་དུ་བགྱིད་པ། མུན་པའི་ཕུང་པོ་རྣམ་པར་འཇིག་པར་བགྱིད་པ། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བགྱིད་པ། མཐུ་ཆེ་བ་ལགས་སོ། །
en: It provides relief to those who are afraid of saṃsāra, generates the knowledge of exhaustion, causes one to realize directly the knowledge of the unborn, overcomes all the aggregates associated with darkness, and removes the burden of suffering. It is very powerful.

source: ཏད་ཡ་ཐཱ། མ་ནཱ་ཀྵ་ཨ་ནཱ་ཀྵ། གྷ་ས་ཀྵ། ཛ་ལ་ཀྵ། མཱ་ནཱ་ཀྵ། ཀྵ་བ་ཀྵ། མན་དྷཱ་ཀྵ། ན་ཌ་ཀྵ། ན་ཌ་ར་ར་ཧུ་བི་ས་ནཱ་ཏ། ཁ་གྷ་ནཱ་ཊ། ཨཱ་ཊ་ནཱ་ཊ་ཀུ་ནཱ་ཊ། པ་རི་ཀུ་ས་ནཱ་ཊ། ནཱ་ཊ་ནཱ་ཊ། པུ་རི་ཀྵ་ནཱ་ཊ། ཨུ་ཊ་ར་ནཱ་ཊ། ཀ་བི་ནཱ་ཊ། ཀུན་ཛ་ནཱ་ཊ། ཨ་མ་ཁ་ནཱ་ཊ། ཙ་བ་མ་བྷ་ནཱ་ཊ། ཁ་ག་མ་བྷ་ནཱ་ཊ། པུ་ཀྵ་ར་ནཱ་ཊ། ཧི་ས་དུ་དྲཱ་ནཱ་ཊ། ས་མ་ལ་ཡ་ནཱ་ཊ། ཤི་ར་ཀུ་མང་ཀཽ་ཏ་ཊ་མ་ཏུ་གུ་ར་བ། ཏྭེ་ཧུ་ཀྵ། བ་ནི་ར་ཛཱུ། དྷྭ་ན་མ་ར་ཛཱུ། བ་གྷ་ན་པུ་ཏེ། ས་ན་ཏི་ར་བ་ཛ་བ། མ་ཧོ་ར་ག་ཛ་ལ། ཨ་ཏྲི་ནཱ། ཨ་ཏྲི་ནཱ། ཨ་ཏྲི་ནཱ་ན་བ། ཨ་ཏྲི་ནཱ་ཀྵ། ཨ་བ་ཧ་མཱརྒ་ཏྲི་ནཱ་ཀྵ། ཨེ་ཥོ་ན་ཏཽ་དུཿཁ་བྷ་ར་སྱ་སྭཱ་ཧཱ།
en: tadyathā: manākṣa anākṣa ghasākṣa jālakṣa mānākṣa kṣavakṣa mandhākṣa naḍakṣa naḍararahuvisanāta khaghanāṭa āṭanāṭakunāṭa parikusanāṭa nāṭanāṭa purikṣanāṭa utaranāṭa kavināṭa kunjanāṭa amakhanāṭa cavamabhanāṭa khagamabhanāṭa pukṣaranāṭa hisadudrānāṭa samalayanāṭa śirakumaṅkautaṭamatugurava tvehukṣa vanirajū dhvanamarajū vaghanapute santiravajava mahoragajala atrinā atrinā atrinānava atrinākṣa avahamārgatrinākṣa eṣonatauduḥkhabharasya svāhā.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོས་རིག་པ་མཆིས་པའི་སྦུབས་ཞི་བ་ལུང་བསྟན་པ་ཆེན་པོ་མཐུ་ཆེ་བ་ཕན་ཡོན་ཆེ་བ་འདི་འདིར་བསྐུར་བ་ལགས་སོ།
en: “Respected Blessed One, the thus-gone Glorious Essence of Flowers confers here this powerful and beneficial great teaching of the peaceful core of knowledge.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་ལེགས་སོ་ཞེས་བྱ་བ་གནང་ངོ་། །བསམ་གཏན་ལ་བརྩོན་པ་རྣམས་མ་གཏོགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་ལྷགས་པའི་སེམས་ཅན་ཐམས་ཅད་དང་ལྡན་པ་རྣམས་ཀྱིས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: The blessed Śākyamuni expressed his approval, as did all the sentient beings who had assembled in the buddha realm of Sahā—except for those who were exerting themselves in concentration.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ང་སྟན་འདི་ཉིད་ལ་བཞུགས་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་རིག་པ་ཡོད་པའི་སྦུབས་ཞི་བའི་གཟུངས་སྔགས་དོན་དང་བཅས་པ། ཚིག་འབྲུ་དང་བཅས་པ། ལྷག་ཆད་མེད་པ་འདི་རྒྱ་ཆེར་སྟོན་པར་མཛད་དོ།
en: Then the Blessed One said to the bodhisattva great being Ākāśagarbha, “Noble son, while sitting here on this seat, I shall teach extensively to sentient beings, with both meaning and words and without adding or omitting anything, this dhāraṇī mantra peaceful core of knowledge.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་དེས་གང་ཁྱོད་ཆས་པའི་དུས་ཀྱི་ཚེ་གསང་སྔགས་གང་དག་གིས་སྡང་བ་ཐམས་ཅད་དད་པར་འགྱུར་བའི་གཟུངས་སྔགས་སྡང་བ་ཞི་བར་བྱེད་པ་དང་། གཉིད་ཀྱིས་ལོག་པར་བྱེད་པ་དང་། དམིགས་པ་མེད་པའི་ཚངས་པའི་གནས་པའི་རྒྱུ་འཐུན་པ་བྱིན་པ་དེ་ཁྱོད་ཀྱིས་ཀྱང་སྟོན་ཅིག །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་བསྟན་པར་བགྱི་ལགས་སོ། །
en: Noble son, please also reveal the mantra that the thus-gone Glorious Essence of Flowers gave when you departed, the dhāraṇī mantra that is the outcome of the sublime states free from concepts and through which all hostile beings develop faith, become pacified, and fall asleep.” “Respected Blessed One, I shall do so:

source: ཏད་ཡ་ཐཱ། བོ་པྲྀ་ཧ་བུ་བུ་བུ་ར། ཏ་ལ་ར་བ་ཨི་ལ་ས་ཧ། ཧ་ཌུ་ཧ་ཊུ། ག་ག་ནཱ་ཀྵ་ཤ་མ་མི་ཏྲ། ཙ་ཀྲ་བརྟི་ཏི་ལེ་སཱ་ག་ར། ཏི་ལེ་དཱུ་ན་ཧི་ལེ། ཧི་ལེ་ཧ་བ་ཧེ། ན་ར་ཛ་ཊེ། ཡ་བ་ན་མི་ཏྲེ། ཀྵི་ཏི་མི་ཏྲེ། པར་མི་ཏྲེ། ཤི་ཁི་མི་ཏྲེ། མ་རུ་ཏྲ་མི་ཏྲེ། ཁ་ག་མི་ཏྲེ། སརྦ་ཨུ་ཛ་མི་ཏྲ། སརྦ་ཀཱ་མ་མི་ཏྲེ། མ་ན་པ་རུ་མི་ཏྲེ། དྷ་ན་ཤྭ་ར་མི་ཏྲེ་སྭཱ་ཧཱ།
en: tadyathā: vovṛhabubura talarava ilasaha haṭūhaṭū gaganākṣaśamamitra cakravrtitilesāgara tiledūnahile hilehavahe narajaṭe yavanamitre kṣitimitre paramitre śikhimitre marutramitre khagamitre sarva ujamitre sarvakāmamitre manaparumitre dhanaśvaramitre svāhā.”

source: ཀྱེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོས་སྡང་བ་ཞི་བར་བྱེད་པ། གཉིད་ཀྱིས་ལོག་པར་བྱེད་པའི་བསྟན་པ་འདི་བཤད་པ་ན་སྡང་བའི་སྦྲུལ་ཐམས་ཅད་རང་གི་གནས་སུ་དོང་ནས་གཉིད་ཀྱིས་ལོག་པར་གྱུར་ཏེ། གང་དག་བཟོད་པ་ཐོབ་པ་རྣམས་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་རྣམས་ནི་མ་གཏོགས་སོ།
en: Oh! As this teaching that pacifies hostile beings and puts them to sleep was being uttered by the bodhisattva great being Ākāśagarbha, all hostile snakes—except for those who had reached acceptance and those who had reached the level of nonregression on the path to unsurpassed and perfect awakening—left for their respective places and fell asleep.

source: །སྲིད་པ་ན་གང་དག་སྡང་བའི་གནོད་སྦྱིན་རྣམས་དང་། གང་དག་སྡང་བའི་ལྷ་མ་ཡིན་རྣམས་དང་ཞེས་བྱ་བ་ནས་སྡང་བའི་ནམ་མཁའ་ལྡིང་རྣམས་ཞེས་བྱ་བའི་བར་དང་། སྡང་བའི་མི་འམ་ཅི་རྣམས་ཞེས་བྱ་བའི་བར་དང་། ཡི་དགས་རྣམས་ཞེས་བྱ་བའི་བར་དང་། ཤ་ཟ་རྣམས་ཞེས་བྱ་བའི་བར་དང་། སྲུལ་པོ་རྣམས་ཞེས་བྱ་བའི་བར་དང་། གང་དག་སྡང་བའི་ལུས་སྲུལ་པོ་རྣམས་ཞེས་བྱ་བའི་བར་དེ་དག་རང་རང་གི་གནས་སུ་དོ
en: Besides the bodhisattvas who had reached acceptance and the level of nonregression, all hostile yakṣas, asuras, garuḍas, mahoragas, pretas, piśācas, pūtanas, and kaṭapūtanas in saṃsāra also left for their respective places and fell asleep.

source: ང་ནས་གཉིད་ཀྱིས་ལོག་པར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཐོབ་པ་རྣམས་དང་། ཕྱིར་མི་ལྡོག་པ་རྣམས་ནི་མ་གཏོགས་སོ། །གང་དག་སྡང་བའི་མི་གཟུ་ལུམས་ཅན་དང་། རྩུབ་པ་དང་། སྙིང་བརྩེ་བ་མེད་པ་དང་། ཕན་ཚུན་མི་འཐུན་པ་དང་། རྟག་ཏུ་ཁྲོ་བ་སྤྱོད་པ་དང་། འཇིག་རྟེན་ཕ་རོལ་གྱིས་འཇིགས་པར་མི་ལྟ་བ་དང་། མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བར་བྱེད་པ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པ་དེ་དག་ཀྱང་སྡང་བ་ཞི་བར་བྱེད་པ། གཉིད་ཀྱིས་ལོག་པར་བྱེད་པའི་བསྟན་པ་འདི་ཐོས་པས་ཐམས་ཅད་མཆོག་ཏུ་བྱམས་པའི་སེམས་དང་ལྡན་པ་དག་དང་། སྙིང་རྗེའི་སེམས་དང་ལྡན་པ་དག་དང་། སྙིང་བརྩེ་བའི་སེམས་དང་ལྡན་པ་དག་དང་། འཁོན་མེད་པའི་སེམས་དང་ལྡན་པ་དག་དང་། མི་འཁྲུགས་པའི་སེམས་དང་ལྡན་པ་དག་དང་།
en: Upon hearing this teaching that pacifies and puts to sleep all the hostile humans who are impetuous, harsh, devoid of affection, and in conflict with one another, as well as those who constantly manifest aggressive behavior, commit the five acts of immediate retribution, reject the sacred Dharma, denigrate the noble ones, and are endowed with the roots of nonvirtue, everyone developed a sincere attitude of love, compassion, and affection and became free of malice and anxiety.

source: ཆོས་ལ་དམིགས་པའི་སེམས་དང་ལྡན་པ་དག་དང་། འཇིག་རྟེན་ཕ་རོལ་གྱིས་འཇིགས་པའི་སེམས་དང་ལྡན་པ་དག་དང་། དཀོན་མཆོག་གསུམ་ལ་ལྷག་པར་གུས་པའི་སེམས་དང་ལྡན་པ་དག་དང་། ཆོས་ལ་དམིགས་པའི་སེམས་དང་ལྡན་པ་དག་དང་། ཞི་བའི་སེམས་དང་ལྡན་པ་དག་ཏུ་གནས་པར་གྱུར་ཏོ།
en: Everyone focused on the Dharma, began to fear the afterlife, developed sincere respect for the Three Jewels, observed the Dharma, and manifested a peaceful mindset.

source: །གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དཔལ་མེ་ཏོག་གི་སྙིང་པོ་དེས་བདག་ཆས་པའི་དུས་ཀྱི་ཚེ་བསྲུང་བའི་སླད་དུ་གང་སྡང་བ་ཞི་བར་བགྱིད་པའི་གཟུངས་སྔགས་སྩལ་བ་ནི་འདི་ལགས་སོ།
en: “Respected Blessed One, this is the dhāraṇī mantra that pacifies hostile beings that the thus-gone Glorious Essence of Flowers conferred to protect me when I departed.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ལ་བཀའ་སྩལ་པ།
en: The thus-gone Śākyamuni then said to Venerable Maudgalyāyana,

source: མཽད་གལ་གྱི་བུ་ཁྱོད་ཀྱིས་སྡང་བ་ཞི་བར་བྱེད་པ་གཉིད་ཀྱིས་ལོག་པར་བྱེད་པའི་གཟུངས་སྔགས་དམིགས་པ་མེད་པའི་ཚངས་པའི་གནས་པའི་རྒྱུ་འཐུན་པ་འདི་ཟུང་ཤིག །
en: “Maudgalyāyana, remember this dhāraṇī mantra that pacifies and puts to sleep hostile beings and that is the outcome of the sublime states free from concepts!

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་རྙེད་པར་དཀའོ། །དེ་བས་ཀྱང་སྡང་བ་ཞི་བར་བྱེད་པ་གཉིད་ཀྱིས་ལོག་པར་བྱེད་པའི་གཟུངས་སྔགས་དམིགས་པ་མེད་པའི་ཚངས་པའི་གནས་པའི་རྒྱུ་འཐུན་པ་འདི་ཆེས་རྙེད་པར་དཀའོ།
en: Maudgalyāyana, it is rare for thus-gone, worthy, perfect buddhas to appear in the world, but it is much more difficult to obtain this dhāraṇī mantra that is the outcome of the sublime states free from concepts and pacifies and puts to sleep hostile beings.

source: །མཽད་གལ་གྱི་བུ་སྡང་བ་ཞི་བར་བྱེད་པ་གཉིད་ཀྱིས་ལོག་པར་བྱེད་པ་འདི་ནི་བསྐལ་པ་བརྒྱ་སྟོང་དུ་ལས་གཞན་མི་བྱེད་པར་བསྟན་ཀྱང་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་། ཐ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་ལ་གནས་པ་རྣམས་ཀྱིས་ཀྱང་རུང་གང་གིས་ཀྱང་དོན་གཟུང་བར་མི་ནུས་སོ། །དེ་བཞིན་གཤེགས་པ་ཉིད་ནི་མ་གཏོགས་ཏེ།
en: Maudgalyāyana, even if one were to teach this mantra that pacifies and puts to sleep hostile beings for a hundred thousand eons without doing anything else, the world with its gods, and even the bodhisattva great beings who dwell on the levels, could not apprehend its meaning—only the thus-gone ones themselves could apprehend it.

source: དེ་ལྟར་ཟབ་ཅིང་དེ་ལྟར་དོན་ཆེ་བ་ཡིན་ལ་དེ་ལྟར་ཕན་ཡོན་ཆེ་བ་ཡིན་ནོ།
en: It is therefore very profound, valuable, and beneficial.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ལམ་དང་། བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཞིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྙིང་རྗེ་ཆེན་པོ་ཡང་ཐོབ་པར་བྱེད་པའོ།
en: It perfects the path to unsurpassed and perfect awakening, it fulfills all wishes, and it causes one to attain the great compassion that ripens sentient beings.

source: །མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་སྡང་བ་ཞི་བར་བྱེད་པ་གཉིད་ཀྱིས་ལོག་པར་བྱེད་པའི་གཟུངས་སྔགས་འདི་ཟུང་ཤིག །དུས་དུས་སུ་སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཅིག །སེམས་ཅན་གང་དག་ཉན་པར་བྱེད་པ་དེ་དག་ཀྱང་ཐོས་པ་ཙམ་གྱིས་ཡོན་ཏན་དང་ཕན་ཡོན་མང་པོ་ཐོབ་པར་འགྱུར་རོ།
en: Therefore, Maudgalyāyana, remember this dhāraṇī mantra that pacifies and puts to sleep hostile beings, and teach it extensively to sentient beings at the proper times. By the mere fact of hearing it, those beings who listen to it will gain many qualities and benefits.

source: །ཁྲོ་བ་མང་པོ་མི་འདོད་པ་མྱོང་བར་འགྱུར་བ་ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་རྣམས་མེད་པར་འགྱུར་རོ། །མི་སྣང་བར་འགྱུར་རོ།
en: The results of the karmic ripening of much aggression, which would otherwise have led to undesired consequences, will vanish and become nonexistent.

source: །འཁོར་བའི་སྐྱོན་མང་པོ་རྣམ་པར་ཤེས་པར་འགྱུར་རོ། །དགེ་བའི་རྩ་བ་མང་པོ་སྐྱེད་པར་འགྱུར་རོ། །བསོད་ནམས་མང་པོ་སོ་སོར་འཛིན་པར་བྱེད་དོ། །དགེ་བའི་བཤེས་གཉེན་མང་པོ་ལ་སྟེན་པར་བྱེད་དོ། །སྙེན་པར་བྱེད་དོ།
en: They will clearly understand the many defects of saṃsāra, they will generate many roots of virtue, they will acquire much merit, and they will attend to, serve, and revere many virtuous friends.

source: །བསྙེན་བཀུར་བྱེད་དོ། །དེས་ན་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: They will therefore not regress from unsurpassed and perfect awakening.

source: །མཽད་གལ་གྱི་བུ་གཟུངས་སྔགས་འདི་ནི་ཆོས་ཀྱི་མར་མེ་འབར་བར་བྱེད་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་ཆད་པར་བྱེད་པ་ཡིན་ནོ།
en: Maudgalyāyana, this dhāraṇī mantra causes the light of the Dharma to blaze, and it ensures that the lineage of the Three Jewels remains uninterrupted.

source: །འདུས་པ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་ཉི་མའི་སྙིང་པོའི་ལེའུ་ལས། གཟུངས་སྔགས་ཀྱི་ལེའུ་སྟེ་གསུམ་པའོ།། །།
en: This concludes the chapter called “The Dhāraṇī Mantras,” the third chapter in “The Quintessence of the Sun,” the Great Vehicle discourse of The Great Assembly.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕོ་ཉ་བཞི་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་དག་ལ་ཡང་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་རང་རང་གི་དགེ་བའི་ཕྱོགས་ཀྱིས་གནས་པར་བྱོས་ཤིག །
en: The Blessed One then said to the four messengers and the other bodhisattva great beings, “Noble sons, abide in this buddha realm by your individual virtues!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་འཁོར་དང་བཅས་ཏེ། གནས་ཇི་ལྟ་བ་བཞིན་དུ་སྐྱིལ་མོ་ཀྲུང་གིས་འཁོད་ནས་ཇི་ལྟར་འཚམ་པ་བཞིན་དུ་བཟོད་པའི་གཟུངས་ལ་སྙོམས་པར་འཇུག་པ་ཤིན་ཏུ་བསྒོམས་པ་དག་གིས་སྙོམས་པར་ཞུགས་སོ། །སྙོམས་པར་ཞུགས་པ་དེ་དག་ཁ་ཅིག་གི་ལུས་ལས་འོད་འདི་ལྟ་བུ་བྱུང་སྟེ། དཔེར་ན་འབྲུ་མར་གྱི་མར་མེ་བཞིན་ནོ།
en: So, together with their retinues, those bodhisattva great beings sat cross-legged in their respective places. Then, those beings who had thoroughly cultivated the absorption of the dhāraṇī of acceptance entered into their respective states of absorption. From the bodies of some of those beings dwelling in equipoise radiated lights like the light emitted by oil lamps.

source: །ཁ་ཅིག་གི་ནི་དཔེར་ན་ཟླ་བ་དང་ཉི་མ་བྱེ་བ་བརྒྱ་སྟོང་གི་འོད་བཞིན་པའི་བར་དུའོ།
en: From the bodies of some others radiated lights like the light emitted by trillions of suns and moons.

source: །ཡང་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱས་འདི་སྙམ་དུ་སེམས་ཏེ། སངས་རྒྱས་ཀྱི་མཐུས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་གིས་ཞུ་བ་ཇི་ལྟ་བུས་དེ་བཞིན་གཤེགས་པ་གཟུངས་སྔགས་བཞི་པོ་ཐམས་ཅད་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་མཛད་པ་དང་།
en: At that moment Venerable Ājñātakauṇḍinya thought, “Through the power of the Buddha, I should make a request to the thus-gone, worthy, perfect Buddha. I should request the Thus-Gone One to teach about those four dhāraṇī mantras in detail.

source: སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་ཇི་ལྟར་ལྷགས་པའི་སེམས་ཅན་རྣམས་ཉན་པར་བྱེད་པ་དང་། ཐེ་ཙོམ་ཐམས་ཅད་སྤོང་བར་འགྱུར་བ་དང་། ཆོས་ཐམས་ཅད་ལ་སྣང་བ་ཐོབ་པ་དང་། ལྟད་མོ་དང་བྲལ་བ་དང་། སོམ་ཉི་ལས་རྒལ་ཅིང་ཐེ་ཙོམ་ལས་རྒལ་བར་འགྱུར་བ་དང་། མྱུར་དུ་སྐྱོན་མེད་པར་འཇུག་པ་དང་། ལོག་པར་མི་ལྟུང་བའི་ཆོས་ཅན་དང་། མཐོ་རིས་ལ་གཞོལ་བར་འགྱུར་བ་དེ་ལྟ་བུར་ཞུ་བར་བྱའོ་སྙམ་མོ།
en: I should ask so that the sentient beings who have arrived in this buddha realm of Sahā may hear this teaching and eliminate all their doubts, attain illumination with respect to all phenomena, become free of excitement, transcend all uncertainties and doubts, swiftly enter into faultlessness, avoid falling into error, and strive for the higher realms.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་རབ་ཏུ་བཏུད་ནས་ཅང་མི་སྨྲ་བར་འདུག་གོ།
en: So, without speaking, Venerable Ājñātakauṇḍinya bowed with his palms joined together in the direction of the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱ་ལ་བཀའ་སྩལ་པ། ཀཽ་ཌི་ནྱ་ཅི་དེ་བཞིན་གཤེགས་པ་ལ་ཁྱོད་ཞུ་བ་ཞུ་བར་འདོད་དམ། གསོལ་པ།
en: The Blessed One asked Venerable Ājñātakauṇḍinya, “Kauṇḍinya, do you wish to ask the Thus-Gone One a question?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ།
en: “Respected Blessed One, indeed!

source: །བཙུན་པ་བདེ་བར་གཤེགས་པ་དེ་བཞིན་ཏེ།
en: Indeed, respected Well-Gone One!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་ཞུ་བ་ཞུས་པ་ལུང་བསྟན་པའི་སླད་དུ་བདག་ལ་སྐབས་ཕྱེ་ན་བཙུན་པ་དེ་བཞིན་གཤེགས་པ་ལ་བདག་ཞུ་བ་འགའ་ཞིག་ཞུ་ལགས་སོ།
en: Respected Blessed One, should I be granted the opportunity, I would like to ask a few questions to the respected Thus-Gone One.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཌི་ནྱ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཁྱོད་གང་དང་གང་འདོད་པ་ཞུས་ཤིག་དང་། ངས་ཞུ་བ་ཞུས་པ་དེ་དང་དེ་ལུང་བསྟན་པས་ཇི་ལྟར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་མངོན་སུམ་དུ་འགྱུར་བ་ལྟར་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: The Blessed One replied, “Kauṇḍinya, you may ask the thus-gone, worthy, perfect Buddha anything you wish. I will elucidate your questions and bring satisfaction to your mind in a way that will be directly understood by the world with its gods.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་གང་ཟག་གི་ཟླ་ནི་སྲེད་པའོ་ཟླ་ནི་སྲེད་པའོ་ཞེས་གསུངས་ལགས་ན།
en: Venerable Ājñātakauṇḍinya then said to the Blessed One, “Respected Blessed One, you have repeatedly stated that craving is a companion of individuals.

source: ཇི་ཙམ་གྱིས་དེ་བཞིན་གཤེགས་པ་གང་ཟག་གི་ཟླ་སྲེད་པ་ལགས་པར་འདོགས་པས་འདོགས་པར་མཛད་ལགས།
en: Why did the Thus-Gone One designate craving as a companion of individuals?

source: ཇི་སྐད་དུ་དེ་བཞིན་གཤེགས་པས་སྐྱེས་བུའི་ཟླ་སྲེད་པ་ནི་ཡུན་རིང་པོར་ཡང་དང་ཡང་འཁོར་ཞིང་ཡང་དང་ཡང་མངལ་ལེན་པར་བྱེད་དོ་ཞེས་གསུངས་ལགས་སོ། །
en: The Thus-Gone One has said that craving—the companion of beings—will cause one to continuously circle and take rebirth in saṃsāra for a long time.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཌི་ནྱས་གང་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་ཞུགས་ཤིང་དུས་དང་འཚམ་པར་ཞུ་བ་ཞུས་པ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One replied, “Kauṇḍinya, you act for the benefit and welfare of many beings. This opportune question is excellent!

source: །ཀཽ་ཌི་ནྱ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ།
en: Therefore, Kauṇḍinya, listen carefully and pay attention. I will now explain this.”

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: Venerable Ājñātakauṇḍinya replied, “Respected Blessed One, I shall do so!” and he listened as the Blessed One had directed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཌི་ནྱ་སྲེད་པ་ཞེས་བྱ་བ་ནི་སྲེད་པ་གསུམ་མོ།
en: The Blessed One then said, “Kauṇḍinya, the term craving refers to three types of craving.

source: །གསུམ་གང་ཞེ་ན།
en: What are the three?

source: འདོད་པའི་སྲེད་པ་དང་། གཟུགས་ཀྱི་སྲེད་པ་དང་། གཟུགས་མེད་པའི་སྲེད་པའོ།།
en: They are (1) the craving related to the desire realm, (2) the craving related to the form realm, and (3) the craving related to the formless realm.

source: གཞན་ཡང་སྲེད་པ་ནི་གསུམ་སྟེ།
en: “There are also three other types of craving:

source: འབྱུང་བའི་སྲེད་པ་དང་། འཇིག་པའི་སྲེད་པ་དང་། ཆོས་ཀྱི་སྲེད་པའོ།
en: (1) the craving related to arising, (2) the craving related to disintegration, and (3) the craving related to phenomena.
